1. Проанализировать структуру БД vk, которую мы создали на занятии, и внести предложения по усовершенствованию
   (если такие идеи есть). Напишите пожалуйста, всё-ли понятно по структуре.

     Проанализировал структуру БД vk, предложенией для серьезных усовершенствований нет.
   По структуре базы данных, созданием таблиц, назначением первичного ключа,
   ссылок на другие таблицы понятно.
   Единственно возникает логичный вопрос по поводу включенияю тех или иных строк в
   таблицы. Насколько хорошо одна большая таблица, но со всевозможными полями
   или лучше много маленьких.
   Но в дальнейшем это будем разбирать подробнее наверное.
